app/controllers/urls_controller.rb

INSERT INTO "urls" ("original_url", "short_url", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"
---
  def create
    @url = Url.new(url_params)
    @url.title = UlrTitleJob.perform_later(@url.original_url)
    @url.short_url = @url.make_url_short

    if @url.save

UPDATE "urls" SET "visit_count" = $1, "updated_at" = $2 WHERE "urls"."id" = $3  [["visit_count", 1], ["updated_at", "2021-08-29 21:18:53.862942"], ["id", 1]]
---
  def visit_original
    @url.update(visit_count: (@url.visit_count + 1))

SELECT "urls".* FROM "urls" ORDER BY "urls"."visit_count" DESC LIMIT $1  [["LIMIT", 100]]
---
  def leader_board
    @urls = Url.order(visit_count: :desc).limit(100)

SELECT "urls".* FROM "urls" WHERE "urls"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def set_url
    @url = Url.find(params[:id])